A2h_0_1_desc =  'Высокая температура (Alarm) C'
A2h_2_3_desc =  'Низкая температура (Alarm) C'
A2h_4_5_desc =  'Высокая температура (Warning) C'
A2h_6_7_desc =  'Низкая температура (Warning) C'
A2h_8_9_desc =  'Высокое напряжение (Alarm) В'
A2h_10_11_desc =  'Низкое напряжение (Alarm) В'
A2h_12_13_desc =  'Высокое напряжение (Warning) В'
A2h_14_15_desc =  'Низкое напряженеи (Warning) В'
A2h_16_17_desc =  'Высокий ток (Alarm) мА'
A2h_18_19_desc =  'Низкий ток (Alarm) мА'
A2h_20_21_desc =  'Высокий ток (Warning) мА'
A2h_22_23_desc =  'Низкий ток (Warning) мА'
A2h_24_25_desc =  'Высокая вх.мощность (Alarm) мВт'
A2h_26_27_desc =  'Низкая вх.мощность (Alarm) мВт'
A2h_28_29_desc =  'Высокая вх.мощность (Warning) мВт'
A2h_30_31_desc =  'Низкая вх.мощность (Warning) мВт'
A2h_32_33_desc =  'Высокая исх.мощность (Alarm) мВт'
A2h_34_35_desc =  'Низкая исх.мощность (Alarm) мВт'
A2h_36_37_desc =  'Высокая исх.мощность (Warning) мВт'
A2h_38_39_desc =  'Низкая исх.мощность (Warning) мВт'
A2h_40_55_desc =  'Не определено'
A2h_56_59_desc =  'RX_PWR(4) мкВт'
A2h_60_63_desc =  'RX_PWR(3) мкВт'
A2h_64_67_desc =  'RX_PWR(2) мкВт'
A2h_68_71_desc =  'RX_PWR(1) мкВт'
A2h_72_75_desc =  'RX_PWR(0) мкВт'
A2h_76_77_desc =  'Ток смещения лазера (Slope) мкА'
A2h_78_79_desc =  'Ток смещения лазера (Offset) мкА'
A2h_80_81_desc =  'Мощность TX (Slope) мкВт'
A2h_82_83_desc =  'Мощность TX (Offset) мкВт'
A2h_84_85_desc =  'Температура (Slope) С'
A2h_86_87_desc =  'Температура (Offset) С'
A2h_88_89_desc =  'Напряжение (Slope) мкВ'
A2h_90_91_desc =  'Напряжение (Offset) мкВ'
A2h_92_94_desc =  'Не определено'
A2h_95_desc =  'Контрольная сумма (0-94)'
A2h_96_97_desc =  'Температруа С'
A2h_98_99_desc =  'Напряжение В'
A2h_100_101_desc =  'Ток мА'
A2h_102_103_desc =  'Мощность TX мВт'
A2h_104_105_desc =  'Мощность RX мВт'
A2h_106_109_desc =  'Не определено'

A2h_110_desc = 'Статус/Контроль'
A2h_110 = {
    7: 'Статус лазера',
    6: 'Выключить лазер',
    5: 'Статус контакта RS1',
    4: 'Статус контакта RS0',
    3: 'Rate Select',
    2: 'TX Fault',
    1: 'LOS',
    0: 'Готов к приему',
}

A2h_111_desc =  'Зарезервировано'

A2h_112 = {
    7: 'Высокая теспература Alarm',
    6: 'Низкая температура Alarm',
    5: 'Высокое напряжение Alarm',
    4: 'Низкое напряжение Alarm',
    3: 'Высокий ток Alarm',
    2: 'Низкий ток Alarm',
    1: 'Высокая исх.мощность Alarm',
    0: 'Низкая исх.мощность Alarm',
}

A2h_113 = {
    7: 'Высокая вх.мощность Alarm',
    6: 'Низкая вх мощность Alarm',
    5: 'Reserverd Alarm',
    4: 'Reserverd Alarm',
    3: 'Reserverd Alarm',
    2: 'Reserverd Alarm',
    1: 'Reserverd Alarm',
    0: 'Reserverd Alarm',
}

A2h_114_desc = 'Не определено'
A2h_115_desc = 'Не определено'

A2h_116 = {
    7: 'Высокая теспература Warning',
    6: 'Низкая температура Warning',
    5: 'Высокое напряжение Warning',
    4: 'Низкое напряжение Warning',
    3: 'Высокий ток Warning',
    2: 'Низкий ток Warning',
    1: 'Высокая исх.мощность Warning',
    0: 'Низкая исх.мощность Warning',
}

A2h_117 = {
    7: 'Высокая вх.мощность Warning',
    6: 'Низкая вх мощность Warning',
    5: 'Reserverd Warning',
    4: 'Reserverd Warning',
    3: 'Reserverd Warning',
    2: 'Reserverd Warning',
    1: 'Reserverd Warning',
    0: 'Reserverd Warning',
}

A2h_118 = {
    7: 'Reserved',
    6: 'Reserved',
    5: 'Reserved',
    4: 'Reserved',
    3: 'Программный RATE_SELECT',
    2: 'Reserved',
    1: 'Максимальный уровень мощности Статус',
    0: 'Максимальный уровень мощности',
}

A2h_119_desc = 'Не определено'

Ah2_120_127_desc = 'Пароль'

A2h_128_247_desc = 'Пользовательските данные'

A2h_248_255_desc = 'Данные вендора'

A2h_writeAllow = [
        0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,
        31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,
        59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,
        87,88,89,90,91,92,93,94,110,111,118,119,120,121,122,123,124,125,126,127,128,129,
        130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,
        151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,
        172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,
        193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,
        214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,
        235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255
]




